In [3]:
import pandas as pd
import numpy as np

In [4]:
print(f"pandas version info: {pd.__version__}")
print(f"numpy version info: {np.__version__}")

pandas version info: 1.0.5
numpy version info: 1.18.5

# Missing Values / Imputation

### 1. 열 별로 결측치가 포함된 레코드의 수 세기 (Determining the number of NA values in columns)

In [13]:
panda_members = {'Name' : ['Ace', 'Baam', 'Choco', "Dill", "Eren", "Foo"],
                'Bamboo': [20, np.nan, 7, np.nan, np.nan, 20],
                'Water': [30, 40, 10, np.nan, 11, 20,]}


DF = pd.DataFrame.from_dict(panda_members)

DF.isna().sum()

Name      0
Bamboo    3
Water     1
dtype: int64

### 2. 결측 포함된 행/열 날리기 (Droping rows/cols with NA values)

In [13]:
panda_members = {'Name' : ['Ace', 'Baam', 'Choco', "Dill", "Eren", "Foo"],
                'Bamboo': [20, np.nan, 7, np.nan, np.nan, 20],
                'Water': [30, 40, 10, np.nan, 11, 20,]}


DF = pd.DataFrame.from_dict(panda_members)

DF

    Name  Bamboo  Water
0    Ace    20.0   30.0
1   Baam     NaN   40.0
2  Choco     7.0   10.0
3   Dill     NaN    NaN
4   Eren     NaN   11.0
5    Foo    20.0   20.0

In [14]:
# drop rows with more than one na value
DF.dropna()

    Name  Bamboo  Water
0    Ace    20.0   30.0
2  Choco     7.0   10.0
5    Foo    20.0   20.0

In [15]:
# drop rows that contains NA value in "Water" column
DF.dropna(subset=["Water"])

    Name  Bamboo  Water
0    Ace    20.0   30.0
1   Baam     NaN   40.0
2  Choco     7.0   10.0
4   Eren     NaN   11.0
5    Foo    20.0   20.0